# PhyMaterialParamTensionPerpendicular Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamTensionPerpendicular Property
ParameterTypeId Class See Also
---
"Tension Perpendicular to Grain"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamTensionPerpendicular { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamTensionPerpendicular As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamTensionPerpendicular {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace